package qf.huesos.kernel.provider.ra;

public enum Opcode {
    PUSH,
    POP,
    ADD,
    SUB,
    MUL,
    DIV,
    CALL,
    VAR,
    STORE,
    LOAD,
    SWAP, // поменять местами последние два значения стека
    DUP, // копировать
    OVER, // копировать верхнее значение через одно вниз
    DROP, // удалить верх стека
    EQ, // равно
    NE, // не равно
    LT, // первое больше второго
    LE, // первое меньше второго
    GT, // второе больше первого
    GE, // второе меньше первого
    JMP, // прыжок
    JZ, // перейти если ноль
    JNZ, // перейти если НЕ ноль
    RET, // ретёрн
    HALT, // остановка
}
